# Python Intro - Final Exercise

In [2]:
import pyodbc
import pandas as pd
import numpy as np

In [3]:
### In windows, Using a ODBC DNS (predefined connection name)
##conn = pyodbc.connect('DSN=COLLEGE;Trusted_Connection=yes;')

In [4]:
### Get the students table
##students = pd.read_sql("SELECT * FROM Students;",conn)
students = pd.read_csv("C:/Users/yuryt/Downloads/Students.csv") 

classrooms = pd.read_csv("C:/Users/yuryt/Downloads/Classrooms.csv") 

teachers = pd.read_csv("C:/Users/yuryt/Downloads/Teachers.csv") 

courses = pd.read_csv("C:/Users/yuryt/Downloads/Courses.csv") 

departments = pd.read_csv("C:/Users/yuryt/Downloads/Departments.csv")

# Questions
 
 
## Q1. Count the number of students on each department

In [5]:
#students
students_classrooms = pd.merge(students, classrooms, how='inner', on='StudentId')

In [6]:
students_classrooms_courses = pd.merge(students_classrooms, courses, how='inner', on='CourseId')

In [7]:
students_classrooms_courses_departments = pd.merge(students_classrooms_courses, departments, how='inner', left_on='DepartmentID', right_on='DepartmentId')

In [19]:
department_student_unique = students_classrooms_courses_departments[['DepartmentName','StudentId']].drop_duplicates()
dsu = department_student_unique.groupby('DepartmentName').agg({'StudentId':['count']})
dsu.columns = ['Students']
dsu

                Students
DepartmentName
Arts                 137
English               84
Science              200
Sport                 81

## Q2. How many students have each course of the English department and the total number of students in the department?

In [43]:
### filter students by department==English
eng_studs = students_classrooms_courses_departments.loc[students_classrooms_courses_departments['DepartmentName'] == 'English']
### group by course and count inside the group
stud_course = eng_studs.groupby('CourseName').agg({'StudentId':['count']})
### Rename aggregated column
stud_course.columns = ['Students']
### count the distinct students in department
distinct_studs = eng_studs.StudentId.drop_duplicates().count()
### add total row
stud_course.loc['Total Distinct']=distinct_studs
stud_course

                      Students
CourseName
Advanced English            24
English Begginers           32
Proffesional English        38
Total Distinct              84

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [40]:
### filter students by department==English
sc_studs = students_classrooms_courses_departments.loc[students_classrooms_courses_departments['DepartmentName'] == 'Science']

sc_studs.groupby('CourseName').agg({'StudentId':['count']})

,StudentId,FirstName,LastName,Gender,CourseId,degree,CourseName,DepartmentID,TeacherId,DepartmentId,DepartmentName
0,162,Elmira,Holston,F,8,65.987050,Chemistry,2,14,2,Science
1,110,Ashleigh,Conder,F,8,81.606452,Chemistry,2,14,2,Science
2,36,Sarah,Sampson,F,8,80.304966,Chemistry,2,14,2,Science
3,234,Adrianna,Bean,F,8,66.921710,Chemistry,2,14,2,Science
4,187,Sabrina,Mcclure,F,8,78.930981,Chemistry,2,14,2,Science
...,...,...,...,...,...,...,...,...,...,...,...
373,53,Chase,Thorstensen,M,5,79.468232,Matematics Advanced,2,13,2,Science
374,83,Adam,Stubblefield,M,5,89.164631,Matematics Advanced,2,13,2,Science
375,222,Courtney,Shannahan,M,5,59.130109,Matematics Advanced,2,13,2,Science
376,237,Joshua,Noel,M,5,68.737008,Matematics Advanced,2,13,2,Science
377,38,Dustin,Mccarthy,M,5,64.103747,Matematics Advanced,2,13,2,Science

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

## Q5. For which courses the percentage of male/female students is over 70%?

## Q6. For each department, how many students passed with a grades over 80?

## Q7. For each department, how many students passed with a grades under 60?

## Q8. Rate the teachers by their average student's grades (in descending order).

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).